app/views/subjects/_form.html.erb

    <%= f.label :teacher_id %><br>
    <%= f.select :teacher_id, options_for_select(Teacher.all.collect{|teacher| ["#{teacher.name} #{teacher.surname}", teacher.id]}, @subject.teacher_id), include_blank: true %>
---
SELECT "teachers".* FROM "teachers"