app/controllers/subjects_controller.rb

INSERT INTO "subjects" ("classroom", "created_at", "name", "teacher_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["classroom", 2], ["created_at", "2014-09-04 16:53:34.293388"], ["name", "Angličtina"], ["teacher_id", 9], ["updated_at", "2014-09-04 16:53:34.293388"]]
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]
---
  def destroy
    @subject.destroy