app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("created_at", "name", "surname", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-04 16:04:21.619675"], ["name", "Miroslava"], ["surname", "Wágnerová"], ["title", "MGR"], ["updated_at", "2014-09-04 16:04:21.619675"]]

  def update
    respond_to do |format|
      if @teacher.update(teacher_params)
---
UPDATE "teachers" SET "name" = ?, "surname" = ?, "updated_at" = ? WHERE "teachers"."id" = 15  [["name", "Jana"], ["surname", "Hozová"], ["updated_at", "2014-09-04 16:57:34.138349"]]

  def destroy
    @teacher.destroy
---
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 8]]