app/controllers/tests_controller.rb

  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save
---
INSERT INTO "tests" ("created_at", "name", "note", "start_date", "subject_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-04 19:08:48.602993"], ["name", "Čtvrtletní písemná práce"], ["note", ""], ["start_date", "2013-05-13"], ["subject_id", 3], ["updated_at", "2014-09-04 19:08:48.602993"]]

    def set_test
      @test = Test.find(params[:id])
---
SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 1]]