app/views/tests/_form.html.erb

SELECT "subjects".* FROM "subjects"
---
    <%= f.label :subject_id %><br>
    <%= f.select :subject_id, options_for_select(Subject.all.collect{|subject| ["#{subject.name}", subject.id]}, @test.subject_id), include_blank: true %>